{"Text":{"0":"Such a good picture quality and gorgeous sound quality and the installation person is very humble gorgeous installation in next day of the delivery installation completed in 30-50 mins.but the cons is this OnePlus tv doesn't support Dolby visionREAD MORE","1":"Best For money and super quality that oneplus has given customer support is very good quick installation not expected delivery within 2 days so very best and the equality of the TV is also best the picture and clarity of the TV is also very good and sound quality is likely differ with various songs on the standard modeREAD MORE","2":"It's very nice TV, delivered in next day and installation done on the same day. Thanks to Flipkart for fast and safe delivery.Got Wall mount in box as well.READ MORE","3":"I purchased this OnePlus TV yesterday. The picture quality is immaculate as well as the sound quality. The brightness and color contrast of the TV is amazing. The installation for the stand setup can be done by yourself as it is pretty simple. Operating the TV is very user-friendly and connecting to wireless platforms like Wi-Fi and Bluetooth are simple. Overall performance is brilliant and the price tag is justified. Outstanding job by OnePlus.READ MORE","4":"No second thoughts.. just go for itWhat you need in TV big screen, good resolution, good picture quality with good sound quality. All this version have. In addition built in chromecast, android 10+, all entertainment apps accessible on 55 inch TV with dynamic sound , bazel free panel and including 1 yr warranty on TV &amp; 2yr warranty on panel at only 44k 😄😄👍👍As a consolation one+bud free of cost ☺️😍, what else you needed in this price... GO FOR IT🏃‍♂️🏃‍♂️READ MORE","5":"On 17th June 2021 received the ONEPLUS U1S 55 inch smart TV. The delivery person delivered carefully and packaging is intact.   On  next day (18-6-2021) installing done( by 11.30 am) and demo shown by service personal who is very well knowledgeable in fitting TV to wall mount and giving demo.     In this model both wall mount and stand was Included by ONEPLUS. I used wall mount.     Used TV all day and giving this review.Used 4k setup box and jio net. Saw Avengers-end game.         I obs...READ MORE","6":"Awesome picture quality, great sound and truly a great experience of watching TV, only con is that there is lag sometimes which I believe can be fixed with updates , rest it is the best TV in this price range..READ MORE","7":"1. Software is very lagging, remote response is worst. Ratting : 1\/52. View angle: OnePlus team have not given importance for the viewing angel. Ratting 1\/53. Wifi connectivity: very worst even sometimes if you keep the near to the tv it shows moderate coverage. Ratting: 1\/54. Sound quality: Dolby sound effects are good with in-built speakers, but for voice and dialogues worst to hear. Ratting 1\/5.5. Gama engine: when you watch 4k scenes with fast action or frames you couldn't experience ...READ MORE","8":"Amazing product with good picture quality and clarity....Flipkart fast deliver and installation was a great add on... (You change change the date of installation to near date after the TV has been shipped)  Don't think twice before buying this TV !!!Detail overview will update after week time usage.READ MORE","9":"Everything is good in this TV, nice picture quality, good sound, and app support. However there are few cons:1. Software is laggy.2. Start time is little more 3. Sound output is variable in different apps. You will have to increase or decrease sound according to app. Especially in Hotstar, it is very low.I hope it will be helpful.READ MORE"}}